TAILS = {

    "миллиард": {
        "додвадцати": {
            0: " миллиардов",
            1: " миллиард",
            2: " миллиарда",
            3: " миллиарда",
            4: " миллиарда",
            5: " миллиардов",
            6: " миллиардов",
            7: " миллиардов",
            8: " миллиардов",
            9: " миллиардов",
            10: " миллиардов",
            11: " миллиардов",
            12: " миллиардов",
            13: " миллиардов",
            14: " миллиардов",
            15: " миллиардов",
            16: " миллиардов",
            17: " миллиардов",
            18: " миллиардов",
            19: " миллиардов"
        },
        "other": " милиардов",
    },
    "миллион": {
        "додвадцати": {
            0: " миллионов",
            1: " миллион",
            2: " миллиона",
            3: " миллиона",
            4: " миллиона",
            5: " миллионов",
            6: " миллионов",
            7: " миллионов",
            8: " миллионов",
            9: " миллионов",
            10: " миллионов",
            11: " миллионов",
            12: " миллионов",
            13: " миллионов",
            14: " миллионов",
            15: " миллионов",
            16: " миллионов",
            17: " миллионов",
            18: " миллионов",
            19: " миллионов"
        },
        "other": " миллионов",
    },
    "тысяча": {
        "додвадцати": {
            0: "тысяч",
            1: " тысяча",
            2: " тысячи",
            3: " тысячи",
            4: " тысячи",
            5: " тысяч",
            6: " тысяч",
            7: " тысяч",
            8: " тысяч",
            9: " тысяч",
            10: " тысяч",
            11: " тысяч",
            12: " тысяч",
            13: " тысяч",
            14: " тысяч",
            15: " тысяч",
            16: " тысяч",
            17: " тысяч",
            18: " тысяч",
            19: " тысяч"
        },
        "other": " тысяч",
    },
    "сотня": {
        "додвадцати": {
            1: "",
            2: "",
            3: "",
            4: "",
            5: "",
            6: "",
            7: "",
            8: "",
            9: "",
            10: "",
            11: "",
            12: "",
            13: "",
            14: "",
            15: "",
            16: "",
            17: "",
            18: "",
            19: ""
        },
        "other": "",
    }
}

DECLINATOR = {
    "RUR": {
        "MAIN": 0,
        "SECONDARY": 1
    },
    "EUR": {
        "MAIN": 0, # один
        "SECONDARY": 0 # один
    },
    "USD": {
        "MAIN": 0, # один
        "SECONDARY": 0 # один
    },
    "CNY": {
        "MAIN": 0, # один
        "SECONDARY": 0, # один
        "TERTIARY": 0

    },
}

NUMBERS = {
    "додвадцати": {
        0: "ноль",
        1: ["один", "одна"],
        2: ["два", "две"],
        3: "три",
        4: "четыре",
        5: "пять",
        6: "шесть",
        7: "семь",
        8: "восемь",
        9: "девять",
        10: "десять",
        11: "одиннадцать",
        12: "двенадцать",
        13: "тринадцать",
        14: "четырнадцать",
        15: "пятнадцать",
        16: "шестнадцать",
        17: "семнадцать",
        18: "восемнадцать",
        19: "девятнадцать",
    },
    "десятки": {
        10: "десять",
        20: "двадцать",     
        30: "тридцать",
        40: "сорок",
        50: "пятьдесят",
        60: "шестьдесят",
        70: "семьдесят",
        80: "восемьдесят",
        90: "девяносто",
    },
    "сотни": {
        100: "сто",
        200: "двести",
        300: "триста",
        400: "четыреста",
        500: "пятьсот",
        600: "шестьсот",
        700: "семьсот",
        800: "восемьсот",
        900: "девятьсот",
    }

}
CURRENCY_ENDINGS = {
    "RUR": {
        "MAIN": {
            1: "рубль",
            2: "рубля",
            3: "рубля",
            4: "рубля",
            5: "рублей",
            6: "рублей",
            7: "рублей",
            8: "рублей",
            9: "рублей",
            0: "рублей"
        },
        "SECONDARY": {
            1: "копейка",
            2: "копейки",
            3: "копейки",
            4: "копейки",
            5: "копеек",
            6: "копеек",
            7: "копеек",
            8: "копеек",
            9: "копеек",
            0: "копеек",
        }
    },
    "EUR": {
        "MAIN": {
            1: "евро",
            2: "евро",
            3: "евро",
            4: "евро",
            5: "евро",
            6: "евро",
            7: "евро",
            8: "евро",
            9: "евро",
            0: "евро"
        },
        "SECONDARY": {
            1: "цент",
            2: "цента",
            3: "цента",
            4: "цента",
            5: "центов",
            6: "центов",
            7: "центов",
            8: "центов",
            9: "центов",
            0: "центов",
        }
    },
    "USD": {
        "MAIN": {
            1: "доллар",
            2: "доллара",
            3: "доллара",
            4: "доллара",
            5: "долларов",
            6: "долларов",
            7: "долларов",
            8: "долларов",
            9: "долларов",
            0: "долларов"
        },
        "SECONDARY": {
            1: "цент",
            2: "цента",
            3: "цента",
            4: "цента",
            5: "центов",
            6: "центов",
            7: "центов",
            8: "центов",
            9: "центов",
            0: "центов",
        }
    },
    "CNY": {
        "MAIN": {
            1: "юань",
            2: "юаня",
            3: "юаня",
            4: "юаня",
            5: "юаней",
            6: "юаней",
            7: "юаней",
            8: "юаней",
            9: "юаней",
            0: "юаней"
        },
        "SECONDARY": {
            1: "цзяо",
            2: "цзяо",
            3: "цзяо",
            4: "цзяо",
            5: "цзяо",
            6: "цзяо",
            7: "цзяо",
            8: "цзяо",
            9: "цзяо",
            0: "цзяо    ",
        },
        "TERTIARY": {
            1: "фынь",
            2: "фыня",
            3: "фыня",
            4: "фыня",
            5: "фыней",
            6: "фыней",
            7: "фыней",
            8: "фыней",
            9: "фыней",
            0: "фыней",
        }
    }
}